[
  {
    "id": 1,
    "projectName": "Docthub",
    "projectImg": "/assets/portfolio/docthub_homePage.png",
    "detail": "<div><h2>Overview:</h2><p><strong>Role:</strong> Software Engineer</p><h2>Introduction:</h2><p>Docthub is a health tech product aimed at facilitating students and medical professionals in gaining access to valuable information about events, courses, and job opportunities in the healthcare industry. My role as a Software Engineer was to develop key features and portals, including a job portal, course portal, events portal, and an admin B2B portal.</p><h2>Problem Statement:</h2><p>The healthcare industry is constantly evolving, and staying updated with the latest events, courses, and job openings can be challenging for students and professionals. Docthub aimed to address this problem by providing a centralized platform for accessing relevant information.</p><h2>Technologies Used:</h2><ul><li><strong>Frontend:</strong> Next.js, React, TypeScript</li></ul><h2>Key Features Developed:</h2><h3>1. Job Portal:</h3><p><strong>Objective:</strong> To provide a platform for job seekers in the healthcare sector to find suitable job openings.</p><p><strong>Functionality:</strong></p><ul><li>Job search and filtering options by location, specialization, and experience level.</li><li>Job listing with detailed job descriptions, requirements, and application links.</li><li>User accounts for saving job listings and applying to jobs.</li></ul><h3>2. Course Portal:</h3><p><strong>Objective:</strong> To offer a comprehensive directory of healthcare-related courses and educational programs.</p><p><strong>Functionality:</strong></p><ul><li>Course search by keywords, institutions, and categories.</li><li>Detailed course information including course duration, curriculum, and prerequisites.</li><li>User reviews and ratings for courses.</li></ul><h3>3. Events Portal:</h3><p><strong>Objective:</strong> To keep users informed about healthcare events, conferences, and workshops.</p><p><strong>Functionality:</strong></p><ul><li>Event listings with dates, locations, and registration details.</li><li>Event search and filtering by specialization and location.</li><li>User registration and event bookmarking.</li></ul><h3>4. Admin B2B Portal:</h3><p><strong>Objective:</strong> To enable authorized users to add and manage data related to jobs, courses, and events.</p><p><strong>Functionality:</strong></p><ul><li>User authentication and authorization.</li><li>Data management interfaces for adding, editing, and deleting job listings, courses, and events.</li><li>Review and approval workflows for user-submitted data.</li></ul><h2>Challenges Faced:</h2><ol><li><strong>Data Validation:</strong> Ensuring that user-submitted data met quality standards and was consistent across the platform.</li><li><strong>Scalability:</strong> Designing the system architecture to handle potential growth in data and user traffic.</li><li><strong>Security:</strong> Implementing robust authentication and authorization mechanisms to protect sensitive data and maintain data integrity.</li></ol><h2>Results and Impact:</h2><ul><li>Docthub successfully launched, providing a valuable resource for students and healthcare professionals.</li><li>User engagement metrics, such as the number of registered users and user reviews, indicated a positive response to the platform.</li><li>Contributed to the growth of the healthcare community by connecting job seekers, learners, and event enthusiasts with relevant opportunities and resources.</li></ul><h2>Conclusion:</h2><p>Working on the Docthub project was a rewarding experience, allowing me to apply my skills in Next.js, React, and TypeScript to create a user-friendly health tech product. It was satisfying to address the challenge of streamlining access to critical healthcare information for users. This project enhanced my expertise in front-end development, data management, and user experience design.</p><h2>Future Enhancements:</h2><ul><li>Continuous improvement of the user interface for better usability.</li><li>Integration of additional features such as personalized recommendations and notifications.</li><li>Expansion of the platform to include more healthcare-related resources.</li></ul></div>"
  },
  {
    "id": 2,
    "projectName": "Avnet",
    "projectImg": "/assets/portfolio/avent_homePage.png",
    "detail": "<div><h2>Overview:</h2><p><strong>Role:</strong> Software Engineer</p><h2>Introduction:</h2><p>Avent is a Fortune 500 company specializing in IoT (Internet of Things) devices. As a Software Engineer, I had the privilege of leading the development of their e-commerce website, which served as a critical component of their digital transformation strategy. This project leveraged Next.js, React, TypeScript, and Node.js to create a cutting-edge IoT shopping experience.</p><h2>Problem Statement:</h2><p>Avent recognized the need to expand its online presence and create a seamless platform for customers to explore, purchase, and manage their IoT devices. The primary challenges were to build a user-friendly e-commerce website that could handle a vast product catalog, support secure transactions, and provide customers with comprehensive IoT device information.</p><h2>Technologies Used:</h2><ul><li><strong>Frontend:</strong> Next.js, React, TypeScript</li><li><strong>Backend:</strong> Node.js</li></ul><h2>Key Features Developed:</h2><h3>1. Product Catalog:</h3><p><strong>Objective:</strong> To showcase Avent's extensive range of IoT devices.</p><p><strong>Functionality:</strong></p><ul><li>Dynamic product listings with detailed product descriptions.</li><li>Advanced search and filtering options for easy product discovery.</li><li>Product comparison tools to aid decision-making.</li></ul><!-- Other key features continue... --><h2>Challenges Faced:</h2><ol><li><strong>Scalability:</strong> Designing an architecture capable of handling a massive product catalog and high user traffic.</li><li><strong>Security:</strong> Implementing robust security measures to protect customer data and transactions.</li><li><strong>Integration:</strong> Ensuring seamless integration with payment gateways, inventory systems, and customer support tools.</li></ol><h2>Results and Impact:</h2><ul><li>The Avent e-commerce website has become a central hub for customers to explore, purchase, and interact with IoT devices, contributing to increased sales and customer engagement.</li><li>The platform received positive feedback from users, particularly for its intuitive design and informative product pages.</li><li>Avent's digital transformation efforts have been bolstered by the successful launch of the e-commerce website, enhancing the company's online presence and customer reach.</li></ul><h2>Conclusion:</h2><p>Working on the Avent IoT e-commerce website project was a transformative experience, allowing me to harness the power of Next.js, React, TypeScript, and Node.js to create a cutting-edge platform for a Fortune 500 company. This project not only expanded my technical skills but also enabled me to contribute to Avent's digital growth in the IoT sector.</p><h2>Future Enhancements:</h2><ul><li>Continued optimization for performance and scalability.</li><li>Implementation of personalized product recommendations.</li><li>Expansion of international shipping and localization features.</li></ul></div>"
  },
  {
    "id": 3,
    "projectName": "Invearn",
    "projectImg": "/assets/portfolio/invearn.png",
    "detail": "<div><p><strong>Overview:</strong> Invearn is more than just a trading platform; it's a passion project born out of a deep love for the financial markets and a commitment to fostering a community of skilled traders. As the founder and visionary behind Invearn, my goal was to create an innovative and collaborative environment where aspiring traders could sharpen their skills, test strategies, and share their knowledge.</p><h2>A Vision for Skill Development</h2><p>Invearn's core concept is simple yet powerful: empower users to trade various financial instruments with infinite Invearn money. This unique approach allows traders to explore the markets without the fear of financial loss, making it an ideal platform for skill development and strategy testing.</p><h2>Building a Collaborative Community</h2><p>Trading can often be a solitary pursuit, but Invearn aims to change that. We envisioned a social media aspect within the platform, creating a space where traders from all walks of life could come together to share insights, experiences, and trading strategies. This sense of community has fostered connections, mentorships, and lifelong friendships among our users.</p><h2>Empowering Education</h2><p>Recognizing the importance of financial literacy, we developed a dedicated course section within Invearn. Here, users can request and upload educational content related to trading and financial literacy. This democratization of knowledge has opened doors for both novice and experienced traders to expand their horizons and refine their trading skills.</p><h2>A Journey Driven by Passion</h2><p>Invearn is a testament to my unwavering passion for trading and my belief in the positive impact it can have on people's lives. This platform is not just a business venture; it's a labor of love, a dream come true, and a way to give back to the trading community.</p><h2>Technical Excellence</h2><p>Behind the scenes, Invearn is powered by a cutting-edge tech stack that ensures a seamless user experience:</p><ul><li><strong>Frontend:</strong> React Native with Expo</li><li><strong>Backend:</strong> MongoDB, Express.js, Node.js</li></ul><p>Our commitment to technical excellence is evident in our open-source contributions, which can be found on GitHub:</p><ul><li><a href='https://github.com/tusharkc/invearn_be'>Backend Repository</a></li><li><a href='https://github.com/tusharkc/invearn_fe'>Frontend App Repository</a></li></ul><h2>Conclusion</h2><p>Invearn is more than a trading platform; it's a hub of inspiration, education, and community. It represents the passion, dedication, and vision that have driven us to create a space where traders can learn, grow, and thrive. Invearn is not just about making money; it's about making a difference in the lives of traders around the world. Our journey has only just begun, and we're excited to continue empowering traders on their path to success. Join us on this incredible journey, and together, let's make every trade count.</p></div>"
  },
  {
    "id": 4,
    "projectName": "Daily New Brief",
    "projectImg": "/assets/portfolio/dailyNewsBrief.png",
    "detail": "<div><p><strong>Role:</strong> Software Engineer</p><p>As a Software Engineer, I had the opportunity to lead the revamp of the Daily New Brief website, transitioning it from a React.js-based platform to Next.js. 'Daily New Brief' is a news platform dedicated to providing users with daily news updates and insightful briefs on various topics. This transition to Next.js aimed to enhance the website's performance, SEO, and overall user experience.</p><h2>Problem Statement:</h2><p>The original 'Daily New Brief' website was built using React.js, which, while powerful for building dynamic web applications, had limitations when it came to server-side rendering (SSR) and search engine optimization (SEO). To address these challenges, we decided to migrate the website to Next.js, a framework known for its SSR capabilities and SEO-friendly architecture.</p><h2>Key Achievements:</h2><h3>1. Improved SEO:</h3><p>By leveraging Next.js's built-in SSR capabilities, we achieved improved SEO rankings, leading to increased organic traffic and user engagement.</p><h3>2. Enhanced Performance:</h3><p>The transition to Next.js significantly improved website performance, reducing page load times and enhancing overall user satisfaction.</p><h3>3. Streamlined Development:</h3><p>Next.js's ease of use and clear project structure streamlined development, enabling our team to iterate quickly and efficiently.</p><h3>4. Improved User Experience:</h3><p>With SSR and optimized performance, users experienced faster page loads, smoother navigation, and improved overall website usability.</p><h2>Challenges Faced:</h2><ol><li><strong>Migrating Existing Code:</strong> Migrating the existing React.js codebase to Next.js required careful planning and code refactoring to ensure a smooth transition.</li><li><strong>Preserving Data Integrity:</strong> Ensuring that user data, articles, and other content were seamlessly migrated to the new platform without data loss or inconsistencies.</li></ol><h2>Results and Impact:</h2><p>The transition to Next.js significantly improved the website's SEO, leading to increased organic traffic and improved visibility on search engines.</p><p>Users experienced faster page loads and an overall improvement in website performance, resulting in higher user satisfaction and engagement.</p><p>The revamped 'Daily New Brief' website positioned the platform for future growth and allowed for more efficient development and feature delivery.</p><h2>Conclusion:</h2><p>Revamping the 'Daily New Brief' website with Next.js was a pivotal step in improving the platform's performance, SEO, and overall user experience. This project demonstrates our commitment to staying up-to-date with modern web technologies and ensuring that our users have access to a top-tier news platform.</p><h2>Future Enhancements:</h2><ul><li>Continued optimization for performance and SEO.</li><li>Implementation of new features to further enhance the user experience.</li><li>Exploration of additional technologies to expand the platform's capabilities.</li></ul></div>"
  },
  {
    "id": 5,
    "projectName": "Surgeon app",
    "projectImg": "/assets/portfolio/surgeon_app.png",
    "detail": "<p><strong>Role:</strong> Full Stack Developer</p><p>As a Full Stack Developer, I was responsible for building the core functionalities of the Surgeon App, a secure digital platform for verified surgeons to collaborate, learn, and automate documentation.</p><h2>Problem Statement:</h2><p>Surgeons often face fragmented systems for collaboration, education, and documentation. There was a need for a centralized, secure platform.</p><h2>Key Achievements:</h2><h3>1. Built Secure Onboarding & Authentication:</h3><p>Developed a custom authentication system with surgeon verification logic.</p><h3>2. Developed Scalable Core Features:</h3><p>Engineered modules like discussion feeds, clinical communities, CME libraries, and vendor booths.</p><h3>3. Integrated HIPAA-Compliant Architecture:</h3><p>Implemented secure APIs and role-based access, focusing on encrypted data handling.</p><h3>4. Enabled Real-Time Collaboration:</h3><p>Used WebSockets for real-time comments, notifications, and updates.</p><h3>5. Integrated AI Tools:</h3><p>Helped implement SurgeOn Scribe, an AI documentation assistant.</p><h2>Impact:</h2><p>Surgeon App grew to 17,000+ verified surgeons globally and became a trusted professional hub for surgical collaboration and learning.</p>"
  }
]
